---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetBoldStatus
source: html/b18ada19-3b5c-0a5a-aeb0-93585774efe2.htm
---
# Autodesk.Revit.DB.FormattedText.GetBoldStatus Method

Returns whether All , None or a Mixed of characters in the entire text are bold.

## Syntax (C#)
```csharp
public FormatStatus GetBoldStatus()
```

## Returns
The format status of bold on characters FormatStatus .

## Remarks
This function only returns All or None if the entire text contains one character.